'''Как считать кол-во различных программ

f[n] - кол-во различных программ, с помощью которых можно получить n из 1

Переходы:

f[n] = f[n - 1] + f[n // 2] + f[n // 3]

'''

''' Код: '''
N = 1000
dp = [0] * N
dp[1] = 1


for n in range(2, N):
    dp[n] = dp[n - 1]
    if n % 2 == 0:
        dp[n] += dp[n//2]
    if n % 3 == 0:
        dp[n] += dp[n//3]

dp = [0] * n
dp[1] = 1

for n in range(1, N):
    if n + 1 < N:
        dp[n + 1] += dp[n]
    if 2 * n < N:
        dp[2 * n] += dp[n]
    if 3 * n < N:
        dp[3 * n] += dp[n] 










    


