# Задача 1
  Исполнитель Простачок преобразует число, записанное на экране. У исполнителя есть три команды, которым присвоены номера:
  1. Прибавить 2
  2. Прибавить 3
  3. Умножить на 2

  Первая команда увеличивает число на 2, вторая – на 3, третья – увеличивает число вдвое. Сколько различных чисел может быть получено из числа `10` всеми возможными алгоритмами длиной `5` команд?

  Ответ: `83`

# Задача 2
  Ниже записана программа, которая вводит натуральное число `x`, выполняет преобразования, а затем выводит два числа. 
  Укажите наименьшее возможное значение `x`, при вводе которого программа выведет числа `4` и `11`.
  ```python
    x = int(input())
    k = x % 8
    a = 0
    b = 0
    while x > 0:
      d = x % 8
      if d == k:
        a += 1
      b += d
      x //= 8
   print(a, b)
  ```
  Ответ: `4729`
